; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck obj - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-4-4-5)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	s0 - location
	s1 - location
	p0-1 - location
	p1-0 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s1)
	(at driver3 s0)
	(at driver4 s1)
	(at truck1 s0)
	(empty truck1)
	(at truck2 s1)
	(empty truck2)
	(at truck3 s0)
	(empty truck3)
	(at truck4 s0)
	(empty truck4)
	(at package1 s0)
	(at package2 s0)
	(at package3 s1)
	(at package4 s0)
	(at package5 s0)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(link s1 s0)
	(link s0 s1)
)
	(:goal (and
	(at driver1 s1)
	(at driver2 s1)
	(at driver3 s0)
	(at driver4 s0)
	(at truck2 s0)
	(at truck3 s0)
	(at truck4 s1)
	(at package1 s1)
	(at package2 s0)
	(at package3 s0)
	(at package4 s0)
	(at package5 s1)
	))


)

; plan
1. (load-truck package5 truck4 s0)
   deleted: (at package5 s0)
   added: (in package5 truck4)
   goals met: 5 of 12
2. (load-truck package3 truck2 s1)
   deleted: (at package3 s1)
   added: (in package3 truck2)
   goals met: 5 of 12
3. (load-truck package1 truck4 s0)
   deleted: (at package1 s0)
   added: (in package1 truck4)
   goals met: 5 of 12
4. (board-truck driver4 truck2 s1)
   deleted: (at driver4 s1) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 5 of 12
5. (drive-truck truck2 s1 s0 driver4)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 6 of 12
6. (disembark-truck driver4 truck2 s0)
   deleted: (driving driver4 truck2)
   added: (at driver4 s0) (empty truck2)
   goals met: 7 of 12
7. (board-truck driver1 truck4 s0)
   deleted: (at driver1 s0) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 7 of 12
8. (drive-truck truck4 s0 s1 driver1)
   deleted: (at truck4 s0)
   added: (at truck4 s1)
   goals met: 8 of 12
9. (disembark-truck driver1 truck4 s1)
   deleted: (driving driver1 truck4)
   added: (at driver1 s1) (empty truck4)
   goals met: 9 of 12
10. (unload-truck package1 truck4 s1)
   deleted: (in package1 truck4)
   added: (at package1 s1)
   goals met: 10 of 12
11. (unload-truck package3 truck2 s0)
   deleted: (in package3 truck2)
   added: (at package3 s0)
   goals met: 11 of 12
12. (unload-truck package5 truck4 s1)
   deleted: (in package5 truck4)
   added: (at package5 s1)
   goals met: 12 of 12
